gh-pages/tensorflow/Running-with-Docker.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Tensorflow를 Docker로 실행하기</title>
<!-- 2018-07-13 Fri 06:33 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Dongsoo Lee" />
</head>
<body>
<div id="content">
<h1 class="title">Tensorflow를 Docker로 실행하기</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 소개</a></li>
<li><a href="#sec-2">2. 이미지 가져오기</a></li>
<li><a href="#sec-3">3. 실행</a></li>
<li><a href="#sec-4">4. 참조</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 소개</h2>
<div class="outline-text-2" id="text-1">
<p>
이 문서는 Tensorflow를 python 환경에서 구동하고 <code>jupyter notebook</code> 과 <code>tensorboard</code> 를 Docker로 실행하는 방법을 기술합니다.
jupyter와 tensorflow의 공식 지원 이미지를 사용합니다.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 이미지 가져오기</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>docker pull tensorflow/tensorflow
</li>
<li>docker pull jupyter/tensorflow-notebook
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 실행</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>마운트할 디렉토리가 위치한 곳을 현재 디렉토리로 만듭니다.
</li>
<li>jupyter notebook를 실행합니다.(tensorflow/tensorflow 내에 =jupyter notebook=이 내장되어 있긴 하지만 버전이 낮고 지원 기능도 적기 때문에 jupyter 이미지를 사용하는 것을 추천합니다)
<ol class="org-ol">
<li>실행
<div class="org-src-container">

<pre class="src src-sh">docker run --rm -it -p 8888:8888 \
-v "`pwd`:/home/jovyan/work" \
jupyter/tensorflow-notebook start.sh jupyter lab
</pre>
</div>
<ul class="org-ul">
<li>jupyter의 work 디렉토리인 <code>/home/jovyan/work</code> 는 고정된 것이므로 변경하면 볼륨 마운트가 되지 않습니다.(jupyter notebook의 루트 디렉토리로 인식합니다.)
</li>
<li>최신버전의 경우 <code>lab</code> 이 기본으로 설정되어 있습니다. 기존 <code>tree</code> 버전을 실행하려면 <code>lab</code> 대신 <code>tree</code> 를 입력하거나 url 주소에 <code>tree</code> 를 입력하면 됩니다.
</li>
</ul>
</li>
<li>브라우저에서 localhost:8888로 연결합니다.(연결 시 token 부분을 같이 입력하면 token을 입력하지 않아도 됩니다.)
</li>
<li>아래 코드로 Tensorflow 작동 확인 및 간단한 그래프를 생성합니다.
<div class="org-src-container">

<pre class="src src-python">import tensorflow as tf

tf.reset_default_graph()

a = tf.add(3, 5)

writer = tf.summary.FileWriter('./graphs', tf.get_default_graph())
writer.close()
</pre>
</div>
</li>
</ol>
</li>
<li>tensorboard를 실행합니다.
<ol class="org-ol">
<li>실행
<div class="org-src-container">

<pre class="src src-sh">docker run --rm -it -p 6006:6006
-v "`pwd`/graphs:/tf_logs" \
tensorflow/tensorflow bash -c "cd .. &amp;&amp; tensorboard --logdir tf_logs"
</pre>
</div>
<ul class="org-ul">
<li>jupyter notebook 에서 graphs 디렉토리가 존재하고 내부에 Tensorflow 그래프 파일이 있어야 정상작동합니다.
</li>
</ul>
</li>
<li>브라우저에서 localhost:6006으로 연결합니다.
</li>
</ol>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 참조</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li><a href="https://hub.docker.com/r/jupyter/tensorflow-notebook/">jupyter/tensorflow-notebook - Docker Hub</a>
</li>
<li><a href="https://hub.docker.com/r/tensorflow/tensorflow/">tensorflow/tensorflow - Docker Hub</a>
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-04-20</p>
<p class="author">Author: Dongsoo Lee</p>
<p class="date">Created: 2018-07-13 Fri 06:33</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
